package level02.normal;

public class Question {

    public static void main(String[] args) {

        /* Q1. 2x3 크기의 정수형 정변 배열을 선언하고, 사용자로부터 값을 입력받아 저장한 후 출력하세요.
         *
         * -- 입력 예시 --
         * 배열 값을 입력하세요:
         * 1 2 3
         * 4 5 6
         *
         * -- 출력 예시 --
         * 배열의 값:
         * 1 2 3
         * 4 5 6
         * */

        /* Q2. 2개의 정수형 배열을 선언하고, 얕은 복사를 수행한 후 배열의 내용을 출력하세요.
         *
         * -- 입력 예시 --
         * 첫 번째 배열 값을 입력하세요: 1 2 3
         * 두 번째 배열 값 (복사 후): 1 2 3
         * */
    }
}
